// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = 5;
int b = 7;

if (a > b )
{
  Console.Write("max = ");
  Console.WriteLine(a);
  Console.Write("min = ");
  Console.WriteLine(b);   
}
else
{
  Console.Write("max = ");
  Console.WriteLine(b);
  Console.Write("min = ");
  Console.WriteLine(a);  
}