// Напишите программу, которая на вход принимает число и 
// выдаёт его квадрат.

Console.Write("введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int sqr = number * number;
Console.WriteLine($"{number} -> {sqr}");

